Bob%20omg%20Model-taurus-plan.yml
---
modules:
  local:
    sequential: true
  jmeter:
    gui: false

execution:
- concurrency: 500
  hold-for: 3600s
  iterations: 10
  ramp-up: 10s
  scenario: source-activity-scenario

scenarios:
  source-activity-scenario:
    requests:
    - url: http://skipjaq.com//team
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//ui
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//take-the-tour
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//case-studies
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//management
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//news
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//hiring.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//ui/awslondon17
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//pricing
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//offices.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//optimize
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//optimse
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//assets/how_illu4-ed49f72….jpg
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//jobs/uk/senior_staff_engineer
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//ghost/blog
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//optimise
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//ui/sign-up
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//terms
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//jobs
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awssummit
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//jobs_senior_java_developer_uk.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//cwjournal
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//jobs/pl/staff_engineer
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//aws17
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//management.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//oss.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//files/skipjaq_whitepaper.pdf
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//offices
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awssignup
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//signup
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awslondon
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//dfdfdsf
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//board
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//index.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//jobs.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awslondon2017
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awslondon.com
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awslondon17
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//]
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//brand.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//aws
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//v2
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com//awssummit17
      method: GET
      assert:
        http-code: 200