modelWed1-taurus-plan.yml
---
modules:
  local:
    sequential: true
  jmeter:
    gui: false

execution:
- concurrency: 500
  hold-for: 3600s
  iterations: 10
  ramp-up: 10s
  scenario: source-activity-scenario

scenarios:
  source-activity-scenario:
    requests:
    - url: http://skipjaq.com/jobs.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs/uk/senior_staff_engineer
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/about.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs/pl/staff_engineer
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/offices
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/team
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/management
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/board
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/terms
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/brand.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/offices.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/ui/sign-up
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/index.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/awslondon17
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/offices Telephone no
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/assets/how_illu4-ed49f72….jpg
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs_senior_developer_pl.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/signup
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs_senior_java_developer_uk.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/ui/login
      method: GET
      assert:
        http-code: 200